# SpaceBoundaryLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..SpaceBoundaryLevel Property
ExporterIFC Class See Also
---
Identifies the level of space boundaries being exported.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int SpaceBoundaryLevel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SpaceBoundaryLevel As Integer
	Get
```

Visual C++
---
```text
public:
property int SpaceBoundaryLevel {
	int get ();
}
```

# Remarks
There are three valid values for this integer: 0 = export no space boundaries. This can save space if the receiving application doesn't use them. 1 = export 1st level space boundaries. This is the default. 2 = export 2nd level space boundaries. This is primarily for use in energy analysis programs, and the GSA.
# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace